/* Задача №1: написать программу, которая заменяет все четные числа в целочисленном статическом массиве на 0. (массив из 10 элементов)
Код программы: */

#include <iostream> // библиотека работы с консолью
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian"); //Русификатор
	int arr[10]; // Целочисленный статический массив из 10 элементов
	cout << "Введите 10 значений в массив" << endl; //Вывод сообщения пользователю
	for (int i(0); i < 10; i++) cin >> arr[i]; //Цикл заполнения массива
	system("cls"); //Очистка консоли
	cout << "Начальный массив: " << endl;
	for (int i(0); i < 10; i++) cout << arr[i] << " "; //Вывод массива до изменения
	cout << endl;
	for (int i(0); i < 10; i++) 
	{
		if (arr[i] % 2 == 0) arr[i] = 0; //Проверка на чётность через остаток от деления на 2 и изменение значения массива если условие истинно
	}
	cout << "Массив с заменёнными значениями: " << endl;
	for (int i(0); i < 10; i++) cout << arr[i] << " "; //Вывод массива после обработки
	return 0;
}

/* Задача №2: ввод символа с клавиатуры(с проверкой что это именно символ), ввод строки с клавиатуры(с проверкой что это именно строка). Вывод в консоль номера, который символ занимает в строке, если он там есть. Если нет — вывод сообщения об отсутствии символа.

Код программы: */

#include <iostream> //библиотека работы с консолью
#include <string> //библиотека работы с типом string

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian"); //Русификатор
	string simvol; //переменная типа string, отвечающая за символ
	string str; //переменная типа string, отвечающая за строку
	cout << "Введите символ" << endl;
	do //проверка на символ
	{
		getline(cin, simvol);
		if (simvol.length() > 1) cout << "Это не символ, повторите попытку" << endl;
	} while (simvol.length() > 1);
	cout << "Введите строку" << endl;
	do //проверка на строку
	{
		getline(cin, str);
		if (str.length() <= 1) cout << "Один символ не является строкой, повторите попытку" << endl;
	} while (str.length() <= 1);
	int z = 0, from = 0; //переменная z для позиции символа в строке, from для предотвращения зацикливания
	while ((z = str.find(simvol, from)) != string::npos) //испольуется find для поиска символа в строке
	{
		cout <<"Символ находится на позиции "<< z << endl;
		from = z + 1;
	}
	if (from == 0) cout << "символ отсутствует" << endl;
	return 0; 
}

/* Задача №3: Расчет определителя матрицы (матрица размером 3 на 3, ввод чисел построчно, числа только целые).

Код программы: */

#include <iostream> //библитека работы с консолью

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian"); //Русификатор
	const int shape = 3; //размерность матрицы
	int arr[shape][shape]; //Целочисленный статический массив (матрица)
	cout << "Введите значения матрицы" << endl;
	for (int i(0); i < shape; i++) //построчный ввод значений матрицы
	{
		for (int j(0); j < shape; j++) cin >> arr[i][j];
	}
	system("cls"); //очистка консоли
	for (int i(0); i < 3; i++) //вывод матрицы
	{
		for (int j(0); j < 3; j++) cout << arr[i][j] << " ";
		cout << endl;
	}
	cout << "Определитель матрицы: " << endl;
	double A = 0;
	A = arr[0][0] * arr[1][1] * arr[2][2] - arr[0][0] * arr[1][2] * arr[2][1]- arr[0][1] * arr[1][0] *arr[2][2] + arr[0][1] * arr[1][2] *arr[2][0]+ arr[0][2] * arr[1][0] * arr[2][1] - arr[0][2] * arr[1][1] * arr[2][0];	cout << A << endl;
	return 0;
}

